Revit 2024 API
ParameterTypeId.StructuralBeamEndAttachmentDistance Property
 "End Attachment Distance"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StructuralBeamEndAttachmentDistance { get; }
Visual Basic
Public Shared ReadOnly Property StructuralBeamEndAttachmentDistance As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructuralBeamEndAttachmentDistance {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace